---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures
source: html/eab97a8a-0a8b-7414-33c0-2b48538202d1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures

Failures about Columns.

## Syntax (C#)
```csharp
public static class ColumnFailures
```